cfe llm/Catalogs/AI_Агенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_Агенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СистемнаяИнструкция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Температура</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксТокенов</Name>					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляЛогики</Name>					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НуженВебПоиск</Name>					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкноКонтекстаВебПоиска</Name>					<Type>
						<v8:Type>cfg:EnumRef.AI_РазмерКонтекстногоОкнаВебПоиска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзвлекатьОтветВСтруктуру</Name>					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийРежим</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильДоступаКДанным</Name>					<Type>
						<v8:Type>d5p1:CatalogRef.AI_ПрофилиДоступаКДанным</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильMCP</Name>					<Type>
						<v8:Type>d5p1:CatalogRef.AI_ПрофилиMCP</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимДоступа</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_РежимДоступаАгента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныйКонтекст</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контекст</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AI_ДополнительныйКонтекст</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>RAGКоллекции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коллекция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AI_RAGКоллекции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛимитФрагментовQdrant</Name>							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесКоллекции</Name>							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МинПорогСхожестиВектора</Name>							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>RAGРазрешения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Разрешение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AI_RAGВидыРазрешений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>URLДляПоиска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>URL</Name>							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступПользователей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПользователя</Name>
							<Type>
								<v8:Type>UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрофильДоступаКДанным</Name>							<Type>
								<v8:Type>d5p1:CatalogRef.AI_ПрофилиДоступаКДанным</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступГрупп</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.AI_ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрофильДоступаКДанным</Name>							<Type>
								<v8:Type>d5p1:CatalogRef.AI_ПрофилиДоступаКДанным</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активна</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗнаний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаборЗнаний</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AI_НаборыЗнаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_НаборыЗнаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_НаборыЗнаний</Name>
			<Comment>Группы переиспользуемых дополнительных контекстов для агентов и сценариев.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляЛогики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контекст</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AI_ДополнительныйКонтекст</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_Сценарии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_Сценарии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипAPI</Name>					<Type>
						<v8:Type>cfg:EnumRef.AI_ТипAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонтракта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаОтветаJSON</Name>					<Comment/><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПовтор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляСтаройОчереди</Name>					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРазбораВложений</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_СпособРазбораВложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаборыЗнаний</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаборЗнаний</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.AI_НаборыЗнаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/CommonModules/AI_Знания/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает активные карточки контекста из наборов знаний агента.
//
// Параметры:
//  Агент - СправочникСсылка.AI_Агенты - агент, для которого назначены наборы.
//
// Возвращаемое значение:
//  Массив из Структура - карточки контекста с источником и версией набора.
//
Функция КонтекстыНаборовАгента(Агент) Экспорт

	Если Не ЗначениеЗаполнено(Агент) Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		| 	Состав.Контекст.ДанныеКонтекста КАК ДанныеКонтекста,
		| 	Состав.Контекст.Наименование КАК Наименование,
		| 	Состав.Контекст.ИдентификаторДляЛогики КАК ИдентификаторДляЛогики,
		| 	Назначения.НаборЗнаний.Наименование КАК НаборЗнаний,
		| 	Назначения.НаборЗнаний.Версия КАК ВерсияНабора
		|ИЗ
		| 	Справочник.AI_Агенты.НаборыЗнаний КАК Назначения
		| 		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.AI_НаборыЗнаний.Состав КАК Состав
		| 		ПО Назначения.НаборЗнаний = Состав.Ссылка
		|ГДЕ
		| 	Назначения.Ссылка = &Агент
		| 	И Назначения.НаборЗнаний.Активен
		| 	И НЕ Назначения.НаборЗнаний.ПометкаУдаления
		| 	И НЕ Состав.Контекст.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		| 	Назначения.НомерСтроки,
		| 	Состав.НомерСтроки";
	Запрос.УстановитьПараметр("Агент", Агент);

	Возврат КонтекстыИзРезультатаЗапроса(Запрос.Выполнить());

КонецФункции

// Возвращает активные карточки контекста из наборов знаний сценария.
//
// Параметры:
//  Сценарий - СправочникСсылка.AI_Сценарии - сценарий, для которого назначены наборы.
//
// Возвращаемое значение:
//  Массив из Структура - карточки контекста с источником и версией набора.
//
Функция КонтекстыНаборовСценария(Сценарий) Экспорт

	Если Не ЗначениеЗаполнено(Сценарий) Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		| 	Состав.Контекст.ДанныеКонтекста КАК ДанныеКонтекста,
		| 	Состав.Контекст.Наименование КАК Наименование,
		| 	Состав.Контекст.ИдентификаторДляЛогики КАК ИдентификаторДляЛогики,
		| 	Назначения.НаборЗнаний.Наименование КАК НаборЗнаний,
		| 	Назначения.НаборЗнаний.Версия КАК ВерсияНабора
		|ИЗ
		| 	Справочник.AI_Сценарии.НаборыЗнаний КАК Назначения
		| 		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.AI_НаборыЗнаний.Состав КАК Состав
		| 		ПО Назначения.НаборЗнаний = Состав.Ссылка
		|ГДЕ
		| 	Назначения.Ссылка = &Сценарий
		| 	И Назначения.НаборЗнаний.Активен
		| 	И НЕ Назначения.НаборЗнаний.ПометкаУдаления
		| 	И НЕ Состав.Контекст.ПометкаУдаления
		|УПОРЯДОЧИТЬ ПО
		| 	Назначения.НомерСтроки,
		| 	Состав.НомерСтроки";
	Запрос.УстановитьПараметр("Сценарий", Сценарий);

	Возврат КонтекстыИзРезультатаЗапроса(Запрос.Выполнить());

КонецФункции

// Добавляет контексты с устранением дублей по логическому идентификатору.
//
// Параметры:
//  Приемник - Массив из Структура - изменяемая коллекция итоговых контекстов.
//  Источник - Массив из Структура - добавляемые контексты.
//  ЗамещатьСуществующие - Булево - более конкретный источник заменяет общий.
//
Процедура ДобавитьБезДубликатов(Приемник, Источник, ЗамещатьСуществующие = Ложь) Экспорт

	Для Каждого Контекст Из Источник Цикл
		Индекс = ИндексКонтекста(Приемник, Контекст.ИдентификаторДляЛогики);
		Если Индекс >= 0 Тогда
			Если Не ЗамещатьСуществующие Тогда
				Продолжить;
			КонецЕсли;
			Приемник.Удалить(Индекс);
		КонецЕсли;
		Приемник.Добавить(Контекст);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КонтекстыИзРезультатаЗапроса(РезультатЗапроса)

	Результат = Новый Массив;
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Контекст = Новый Структура;
		Контекст.Вставить("ДанныеКонтекста", Выборка.ДанныеКонтекста);
		Контекст.Вставить("Наименование", Выборка.Наименование);
		Контекст.Вставить("ИдентификаторДляЛогики", Выборка.ИдентификаторДляЛогики);
		Контекст.Вставить("НаборЗнаний", Выборка.НаборЗнаний);
		Контекст.Вставить("ВерсияНабора", Выборка.ВерсияНабора);
		Результат.Добавить(Контекст);
	КонецЦикла;
	Возврат Результат;

КонецФункции

Функция ИндексКонтекста(Контексты, Идентификатор)

	Для Индекс = 0 По Контексты.Количество() - 1 Цикл
		Если Контексты[Индекс].ИдентификаторДляЛогики = Идентификатор Тогда
			Возврат Индекс;
		КонецЕсли;
	КонецЦикла;
	Возврат -1;

КонецФункции

#КонецОбласти
